
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |          16 |          0 |
## Affected resources by action

|  Action  | Resources                                                             |
|:--------:|:----------------------------------------------------------------------|
|    🟡    | `module.jumphost.aws_efs_file_system.home-enc`                        |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                |
|    🟡    | `module.mail_twindb_com.aws_efs_file_system.mail`                     |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                      |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                  |
|    🟡    | `module.mail_twindb_com.aws_lb.postfix`                               |
|    🟡    | `module.mail_twindb_com.aws_lb_target_group.postfix`                  |
|    🟡    | `module.mail_twindb_com.aws_security_group.efs`                       |
|    🟡    | `module.mail_twindb_com.aws_security_group.postfix`                   |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.default`   |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs`       |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs`      |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp` |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp`     |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp`     |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh`      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.aws_efs_file_system.home-enc will be updated in-place
  ~ resource "aws_efs_file_system" "home-enc" {
        id                              = "fs-0ab965ea5b50e59a9"
        name                            = "jumphost-home-encrypted"
        tags                            = {
            "Name"              = "jumphost-home-encrypted"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (14 unchanged attributes hidden)

      ~ protection {
          ~ replication_overwrite = "REPLICATING" -> "DISABLED"
        }
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "28" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "mta-twindb.com"
        }

        # (6 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_efs_file_system.mail will be updated in-place
  ~ resource "aws_efs_file_system" "mail" {
        id                              = "fs-0109046602941ae5d"
        name                            = "mail"
      ~ tags                            = {
            "Name"              = "mail"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                        = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ latest_version                       = 28 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
      ~ tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                             = {
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mail_twindb_com.aws_lb.postfix will be updated in-place
  ~ resource "aws_lb" "postfix" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/postfi20240326221548268900000007/26efeb70ca02a0ad"
        name                                                         = "postfi20240326221548268900000007"
      ~ tags                                                         = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "module_version"    = "0.5.0"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                                                     = {
          + "module_version"    = "0.5.0"
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_lb_target_group.postfix will be updated in-place
  ~ resource "aws_lb_target_group" "postfix" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/postfi20240326221547236100000005/dac90856391b4623"
        name                               = "postfi20240326221547236100000005"
      ~ tags                               = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                           = {
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_security_group.efs will be updated in-place
  ~ resource "aws_security_group" "efs" {
        id                     = "sg-081bd24660a5aa754"
        name                   = "mail-efs-20240326221547235900000004"
      ~ tags                   = {
            "Name"              = "EFS mail storage"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_security_group.postfix will be updated in-place
  ~ resource "aws_security_group" "postfix" {
        id                     = "sg-0294b0bcce4c62120"
        name                   = "postfix20240326221547232500000002"
      ~ tags                   = {
            "Name"              = "postfix"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.default will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "default" {
        id                     = "sgr-053feb193fcac08e6"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "efs" {
        id                     = "sgr-0f40ad30271f88e3e"
      ~ tags                   = {
            "Name"              = "EFS outgoing traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs" {
        id                     = "sgr-096d1cca0913bfdad"
      ~ tags                   = {
            "Name"              = "NFS traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
        id                     = "sgr-0ea4b31fe8981f1c1"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "icmp" {
        id                     = "sgr-057ebae58c99a47c3"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "smtp" {
        id                     = "sgr-086f6961438ffd42b"
      ~ tags                   = {
            "Name"              = "SMTP access"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "ssh" {
        id                     = "sgr-07100a2bff2e1adef"
      ~ tags                   = {
            "Name"              = "SSH access"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 16 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAxNiwgImRlc3Ryb3kiOiAwfX0=
```
</details>